app/controllers/back_clients_controller.rb

  def clients_comm
    @client =AboutComm.find_by_name('client')
---
SELECT * FROM `about_comms` WHERE (`about_comms`.`name` = 'client') LIMIT 1

  def clients_new
    @temp =AboutComm.find_by_name('client')
    unless @temp
      @about_comm= AboutComm.new
      @about_comm.update_attribute(:name,'client' )
      @about_comm.save
---
SELECT * FROM `about_comms` WHERE (`about_comms`.`name` = 'client') LIMIT 1
INSERT INTO `about_comms` (`name`, `updated_at`, `author`, `admin`, `content`, `email`, `created_at`) VALUES('client', '2009-06-25 13:29:35', NULL, NULL, NULL, NULL, '2009-06-25 13:29:35')