app/controllers/back_solutions_controller.rb

SELECT * FROM `solutions` ORDER BY updated_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `solutions`
---
  def list#shwo
    @solutions = Solution.paginate( :page => params[:page],
      :per_page => 10,
      :order => "updated_at DESC")

SELECT * FROM `solutions` WHERE (`solutions`.`id` = 6)
---
  def show
    if params[:list]
      @solution = Solution.find(:first,:conditions => [ "id = ?" , params[:list]])

SELECT * FROM `solutions` WHERE (`solutions`.`id` = 6)
---
  def edit
    @solution = Solution.find(params[:id])

SELECT * FROM `solutions` WHERE (`solutions`.`id` = 6)
DELETE FROM `solutions` WHERE `id` = 6
---
  def destroy
    @solution = Solution.find(params[:id])
    @solution.destroy