app/controllers/back_services_controller.rb

SELECT * FROM `service_types` WHERE (`service_types`.`id` = 3) LIMIT 1
---
  def music_col
    @music =ServiceType.find(:first,:conditions=>{:id=>3})

SELECT * FROM `abouts` WHERE (`abouts`.`name` = 'music') LIMIT 1
---
  def music_new
    @music =About.find_by_name('music')

SELECT * FROM `service_types` WHERE (`service_types`.`id` = 1) LIMIT 1
---
  def system_col
    @system =ServiceType.find(:first,:conditions => {:id=>1});

SELECT * FROM `abouts` WHERE (`abouts`.`name` = 'system') LIMIT 1
---
  def system_new
    @system =About.find_by_name('system')

SELECT * FROM `service_types` WHERE (`service_types`.`id` = 2) LIMIT 1
---
  def soft_col
    @soft =ServiceType.find(:first,:conditions=>{:id=>2})

SELECT * FROM `service_types` WHERE (`service_types`.`id` = 4) LIMIT 1
---
  def train_col
    @train =ServiceType.find(:first,:conditions=>{:id=>4})

SELECT * FROM `abouts` WHERE (`abouts`.`name` = 'servlist') LIMIT 1
---
  def servlist_col
    @servlist =About.find_by_name('servlist')