app/controllers/back_about_controller.rb

  def com_col
    @com_col =About.find_by_name('com_col')
---
SELECT * FROM `abouts` WHERE (`abouts`.`name` = 'com_col') LIMIT 1

    def team_col
    @team_col =About.find_by_name('team_col')
---
SELECT * FROM `abouts` WHERE (`abouts`.`name` = 'team_col') LIMIT 1

  def princ
    @princ =About.find_by_name('princ')
---
SELECT * FROM `abouts` WHERE (`abouts`.`name` = 'princ') LIMIT 1

  def com_page
    @com_page =About.find_by_name('com_page')
---
SELECT * FROM `abouts` WHERE (`abouts`.`name` = 'com_page') LIMIT 1

  def team_page
    @team_page =About.find_by_name('team_page')
---
SELECT * FROM `abouts` WHERE (`abouts`.`name` = 'team_page') LIMIT 1