app/controllers/back_home_controller.rb

SELECT * FROM `abouts` WHERE (`abouts`.`name` = 'wel') LIMIT 1
---
  def wel
    @wel =About.find_by_name('wel')