app/controllers/back_partners_controller.rb

SELECT * FROM `partners` ORDER BY updated_at DESC LIMIT 0, 10
---
  def list#shwo
    @partners = Partner.paginate( :page => params[:page],
      :per_page => 10,
      :order => "updated_at DESC")

SELECT * FROM `partners` WHERE (id = '3') LIMIT 1
---
  def show
    if params[:list]
      @partner = Partner.find(:first,:conditions => [ "id = ?" , params[:list]])

SELECT * FROM `about_comms` WHERE (`about_comms`.`name` = 'partner') LIMIT 1
---
  def partners_comm
    @partner =AboutComm.find_by_name('partner')