app/controllers/back_footer_controller.rb

  def footer
    @footer =About.find_by_name('footer')
---
SELECT * FROM `abouts` WHERE (`abouts`.`name` = 'footer') LIMIT 1