app/controllers/bloggers_controller.rb

INSERT INTO `bloggers` (`salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('f94d2b557a2094c630f2597581a263fb9704a23a', '2009-06-24 06:38:03', '2b0b17b22ee7903e44a3651f819b5776004900da', NULL, NULL, 'DerDer', 'drive2me@hotmail.com', '2009-06-24 06:38:03')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @blogger = Blogger.new(params[:blogger])
    @blogger.save