app/controllers/services_controller.rb

  def index
    #@services = Service.find(:all,:order => 'updated_at desc',:limit =>15)
    @services=Service.paginate :page=>params[:page],:per_page=>5
---
SELECT * FROM `services` LIMIT 0, 15
SELECT count(*) AS count_all FROM `services`

  def show
    @service = Service.find(params[:id])
---
SELECT * FROM `services` WHERE (`services`.`id` = 1)