app/controllers/solutions_controller.rb

SELECT * FROM `solutions` LIMIT 0, 5
SELECT count(*) AS count_all FROM `solutions`
---
  def index
   @solutions=Solution.paginate :page=>params[:page],:per_page=>5

SELECT * FROM `solutions` WHERE (`solutions`.`id` = 1)
---
  def show
    @solution = Solution.find(params[:id])